Extensions/src/Documents/РС_ЭлектроннаяНакладная/РС_ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РС_ЭлектроннаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Получил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ID_ТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КомментарийТН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДоставкиТН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЭтоПодарок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Имущество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>UNIT_TXT</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>16</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>25</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>A_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>PRICE</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>STATUS</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>25</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ИмяПараметраRS</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>32</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыОперацийРасходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаПокупателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/РС_ЭлектроннаяНакладная/ObjectModule.bsl
&Вместо("ЗаполнитьДанныеДляОбмена")
Процедура РасшAzRy_ЗаполнитьДанныеДляОбмена(СсылкаНаДокумент)
	
	Дата = ТекущаяДата();
	ИспользоватьАдресИзДоговораДляТТН = Константы.ОПТИМУС_ИспользоватьАдресИзДоговораДляТТН.Получить();
	Организация						  = СсылкаНаДокумент.Организация;
		
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= ?((СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Или
									СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение ИЛИ СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)  
									,Перечисления.РС_ТипыТН.ВнутреннееПеремещение, ?(МобильныйСклад, Перечисления.РС_ТипыТН.ПодчиненнаяТН, Перечисления.РС_ТипыТН.РеализацияСТранспортировкой));
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		
		
		ТипТН 					= Перечисления.РС_ТипыТН.РеализацияСТранспортировкой;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;			
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Договор = СсылкаНаДокумент.Договор;//перем
		
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= Перечисления.РС_ТипыТН.ВозвратОтПокупателя;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= СсылкаНаДокумент.Контрагент;
		АдресОтправки	 		= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);		
		ГрузоПолучатель 		= СсылкаНаДокумент.Организация;
		АдресДоставки   		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ТранспортноеСредство 	= Договор.ТранспортноеСредство;
		ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;		
		Водитель			 	= Договор.Водитель;
		НомерУдостоверения   	= Водитель.ИНН;
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;

	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ФактАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;		
		
		Если СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.МобильныйСклад Тогда
			ТипТН 					= Перечисления.РС_ТипыТН.Дистрибуция;
			ТранспортноеСредство 	= СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= ТранспортноеСредство.ОсновнойВодитель;
			НомерУдостоверения   	= Водитель.ИНН;
		Иначе
			ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		КонецЕсли;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница,				ФактАдрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель,	ФактАдрес);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		//ВидЦены				= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		
		//ТранспортноеСредство = СсылкаНаДокумент.Договор.ТранспортноеСредство;
		//Водитель			 = СсылкаНаДокумент.Договор.Водитель;
		//НомерУдостоверения   = Водитель.ИНН;
		//ГосНомерАвтомобиля	 = ТранспортноеСредство.Код;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеВА") Тогда
		
		ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].Адрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].АдресПолучатель);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.Покупатель;
		МобильныйСклад   = СсылкаНаДокумент.СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор          = СсылкаНаДокумент.Контрагент.ДоговорПоУмолчанию;//Перем
		АдресПоДоговору  = СсылкаНаДокумент.Контрагент.ДоговорПоУмолчанию.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);	
		
		ТипТН 					= Перечисления.РС_ТипыТН.РеализацияСТранспортировкой;	
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
				
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	КонецЕсли;	

КонецПроцедуры

&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
КонецПроцедуры
